Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEdsadc_reg.h
/** \brief 878, Boundary Select Register 7 */
#define EDSADC_CH7_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024878u)
/** Alias (User Manual Name) for EDSADC_CH7_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH7_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL7 (EDSADC_CH7_BOUNDSEL)

/** \brief 880, Result Register 7 Auxiliary */
#define EDSADC_CH7_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024880u)
/** Alias (User Manual Name) for EDSADC_CH7_RESA.
* To use register names with standard convension, please use EDSADC_CH7_RESA.
*/
#define EDSADC_RESA7 (EDSADC_CH7_RESA)

/** \brief 8A0, Carrier Generator Synchronization Reg. 7 */
#define EDSADC_CH7_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF00248A0u)
/** Alias (User Manual Name) for EDSADC_CH7_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH7_CGSYNC.
*/
#define EDSADC_CGSYNC7 (EDSADC_CH7_CGSYNC)

/** \brief 8A8, Rectification Configuration Register 7 */
#define EDSADC_CH7_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF00248A8u)
/** Alias (User Manual Name) for EDSADC_CH7_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH7_RECTCFG.
*/
#define EDSADC_RECTCFG7 (EDSADC_CH7_RECTCFG)

/** \brief 8B0, Common Mode Voltage Register 7 */
#define EDSADC_CH7_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF00248B0u)
/** Alias (User Manual Name) for EDSADC_CH7_VCM.
* To use register names with standard convension, please use EDSADC_CH7_VCM.
*/
#define EDSADC_VCM7 (EDSADC_CH7_VCM)

/** \brief 900, Modulator Configuration Register 8 */
#define EDSADC_CH8_MODCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_MODCFG*)0xF0024900u)
/** Alias (User Manual Name) for EDSADC_CH8_MODCFG.
* To use register names with standard convension, please use EDSADC_CH8_MODCFG.
*/
#define EDSADC_MODCFG8 (EDSADC_CH8_MODCFG)

/** \brief 908, Demodulator Input Config. Register 8 */
#define EDSADC_CH8_DICFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_DICFG*)0xF0024908u)
/** Alias (User Manual Name) for EDSADC_CH8_DICFG.
* To use register names with standard convension, please use EDSADC_CH8_DICFG.
*/
#define EDSADC_DICFG8 (EDSADC_CH8_DICFG)

/** \brief 910, Filter Configuration Register 8, Main */
#define EDSADC_CH8_FCFGM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGM*)0xF0024910u)
/** Alias (User Manual Name) for EDSADC_CH8_FCFGM.
* To use register names with standard convension, please use EDSADC_CH8_FCFGM.
*/
#define EDSADC_FCFGM8 (EDSADC_CH8_FCFGM)

/** \brief 914, Filter Configuration Register 8, CIC Filter */
#define EDSADC_CH8_FCFGC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGC*)0xF0024914u)
/** Alias (User Manual Name) for EDSADC_CH8_FCFGC.
* To use register names with standard convension, please use EDSADC_CH8_FCFGC.
*/
#define EDSADC_FCFGC8 (EDSADC_CH8_FCFGC)

/** \brief 918, Filter Counter Register 8, CIC Filter */
#define EDSADC_CH8_FCNTC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCNTC*)0xF0024918u)
/** Alias (User Manual Name) for EDSADC_CH8_FCNTC.
* To use register names with standard convension, please use EDSADC_CH8_FCNTC.
*/
#define EDSADC_FCNTC8 (EDSADC_CH8_FCNTC)

/** \brief 91C, Overshoot Compensation Cfg. Register 8 */
#define EDSADC_CH8_OVSCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OVSCFG*)0xF002491Cu)
/** Alias (User Manual Name) for EDSADC_CH8_OVSCFG.
* To use register names with standard convension, please use EDSADC_CH8_OVSCFG.
*/
#define EDSADC_OVSCFG8 (EDSADC_CH8_OVSCFG)

/** \brief 920, Integration Window Control Register 8 */
#define EDSADC_CH8_IWCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IWCTR*)0xF0024920u)
/** Alias (User Manual Name) for EDSADC_CH8_IWCTR.
* To use register names with standard convension, please use EDSADC_CH8_IWCTR.
*/
#define EDSADC_IWCTR8 (EDSADC_CH8_IWCTR)

/** \brief 924, Intermediate Integration Value */
#define EDSADC_CH8_IIVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_IIVAL*)0xF0024924u)
/** Alias (User Manual Name) for EDSADC_CH8_IIVAL.
* To use register names with standard convension, please use EDSADC_CH8_IIVAL.
*/
#define EDSADC_IIVAL8 (EDSADC_CH8_IIVAL)

/** \brief 928, Integrator Status Register 8 */
#define EDSADC_CH8_ISTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_ISTAT*)0xF0024928u)
/** Alias (User Manual Name) for EDSADC_CH8_ISTAT.
* To use register names with standard convension, please use EDSADC_CH8_ISTAT.
*/
#define EDSADC_ISTAT8 (EDSADC_CH8_ISTAT)

/** \brief 92C, Result FIFO Control Register 8 */
#define EDSADC_CH8_RFC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RFC*)0xF002492Cu)
/** Alias (User Manual Name) for EDSADC_CH8_RFC.
* To use register names with standard convension, please use EDSADC_CH8_RFC.
*/
#define EDSADC_RFC8 (EDSADC_CH8_RFC)

/** \brief 930, Result Register 8 Main */
#define EDSADC_CH8_RESM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESM*)0xF0024930u)
/** Alias (User Manual Name) for EDSADC_CH8_RESM.
* To use register names with standard convension, please use EDSADC_CH8_RESM.
*/
#define EDSADC_RESM8 (EDSADC_CH8_RESM)

/** \brief 938, Offset Compensation Register 8 */
#define EDSADC_CH8_OFFCOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_OFFCOMP*)0xF0024938u)
/** Alias (User Manual Name) for EDSADC_CH8_OFFCOMP.
* To use register names with standard convension, please use EDSADC_CH8_OFFCOMP.
*/
#define EDSADC_OFFCOMP8 (EDSADC_CH8_OFFCOMP)

/** \brief 93C, Gain Calibration Register 8 */
#define EDSADC_CH8_GAINCAL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCAL*)0xF002493Cu)
/** Alias (User Manual Name) for EDSADC_CH8_GAINCAL.
* To use register names with standard convension, please use EDSADC_CH8_GAINCAL.
*/
#define EDSADC_GAINCAL8 (EDSADC_CH8_GAINCAL)

/** \brief 940, Gain Control Register 8 */
#define EDSADC_CH8_GAINCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_GAINCTR*)0xF0024940u)
/** Alias (User Manual Name) for EDSADC_CH8_GAINCTR.
* To use register names with standard convension, please use EDSADC_CH8_GAINCTR.
*/
#define EDSADC_GAINCTR8 (EDSADC_CH8_GAINCTR)

