Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEdsadc_reg.h
/** \brief A70, Auxiliary Filter Configuration Register 9 */
#define EDSADC_CH9_FCFGA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_FCFGA*)0xF0024A70u)
/** Alias (User Manual Name) for EDSADC_CH9_FCFGA.
* To use register names with standard convension, please use EDSADC_CH9_FCFGA.
*/
#define EDSADC_FCFGA9 (EDSADC_CH9_FCFGA)

/** \brief A78, Boundary Select Register 9 */
#define EDSADC_CH9_BOUNDSEL /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_BOUNDSEL*)0xF0024A78u)
/** Alias (User Manual Name) for EDSADC_CH9_BOUNDSEL.
* To use register names with standard convension, please use EDSADC_CH9_BOUNDSEL.
*/
#define EDSADC_BOUNDSEL9 (EDSADC_CH9_BOUNDSEL)

/** \brief A80, Result Register 9 Auxiliary */
#define EDSADC_CH9_RESA /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RESA*)0xF0024A80u)
/** Alias (User Manual Name) for EDSADC_CH9_RESA.
* To use register names with standard convension, please use EDSADC_CH9_RESA.
*/
#define EDSADC_RESA9 (EDSADC_CH9_RESA)

/** \brief AA0, Carrier Generator Synchronization Reg. 9 */
#define EDSADC_CH9_CGSYNC /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_CGSYNC*)0xF0024AA0u)
/** Alias (User Manual Name) for EDSADC_CH9_CGSYNC.
* To use register names with standard convension, please use EDSADC_CH9_CGSYNC.
*/
#define EDSADC_CGSYNC9 (EDSADC_CH9_CGSYNC)

/** \brief AA8, Rectification Configuration Register 9 */
#define EDSADC_CH9_RECTCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_RECTCFG*)0xF0024AA8u)
/** Alias (User Manual Name) for EDSADC_CH9_RECTCFG.
* To use register names with standard convension, please use EDSADC_CH9_RECTCFG.
*/
#define EDSADC_RECTCFG9 (EDSADC_CH9_RECTCFG)

/** \brief AB0, Common Mode Voltage Register 9 */
#define EDSADC_CH9_VCM /*lint --e(923, 9078)*/ (*(volatile Ifx_EDSADC_CH_VCM*)0xF0024AB0u)
/** Alias (User Manual Name) for EDSADC_CH9_VCM.
* To use register names with standard convension, please use EDSADC_CH9_VCM.
*/
#define EDSADC_VCM9 (EDSADC_CH9_VCM)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEDSADC_REG_H */
